       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       PROCEDURE DIVISION.
      *I don't know what I'm doing here but it will be fun to find out
      *First COBOL writing to test VSCode for AoC 2025
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
